fa-xbrl/src/Catalogs/velpo_EntryPoints/velpo_EntryPoints.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>velpo_EntryPoints</name>
  <owners>Catalog.velpo_Taxonomies</owners>
  <attributes>
    <name>Name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LongDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Version</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>CatalogRef.velpo_Languages</types>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>RoleTypes</name>
    <attributes>
      <name>RoleType</name>
      <type>
        <types>CatalogRef.velpo_RoleTypes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>RoleTables</name>
    <attributes>
      <name>RoleTable</name>
      <type>
        <types>CatalogRef.velpo_RoleTables</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

fa-xbrl/src/Catalogs/velpo_EntryPoints/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// FA-XBRL, Bookkeeping and XBRL proccessor
//
// @author: Paul Tarasov
//	@email: paul.tarasov@velpo.ru
// 
// Copyright (c) 2021 Paul Tarasov (Velpo)
///////////////////////////////////////////////////////////////////////////////////////////////////////

Function GetStructure() Export

	Return New Structure(velpo_TaxonomyUpdateClientServerCached.GetEntryPointAttribs()); 	

EndFunction // GetItemStructure()

Function GetItem(Attribs, Create = True) Export
	
	EntryPointRef = Catalogs.velpo_EntryPoints.FindByDescription(Attribs.Description);
		
	If  Create And EntryPointRef = Catalogs.velpo_EntryPoints.EmptyRef() Then
		TableNames = "RoleTypes,RoleTables";
		EntryPointObject = Catalogs.velpo_EntryPoints.CreateItem();
		FillPropertyValues(EntryPointObject, Attribs,, TableNames);
		EntryPointObject.LongDescription = Attribs.Description; 
		TableNamesArray = StrSplit(TableNames, ",");
		For Each TableName In TableNamesArray Do
			If Attribs[TableName] <> Undefined Then
				ColumnName = Left(TableName, StrLen(TableName) - 1);
				For Each RoleRef In Attribs[TableName] Do
					RoleRow = EntryPointObject[TableName].Add();
					RoleRow[ColumnName] = RoleRef;
				EndDo; 
			EndIf;		
		EndDo; 
		EntryPointObject.Write();
		EntryPointRef = EntryPointObject.Ref;
	EndIf;
	
	Return EntryPointRef;

EndFunction // Create()
